
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Загрузить Облигацию с MOEX.
// 
// Параметры:
//  SECID - Строка
//  ОблигацияОбъект  - СправочникОбъект.Облигации
Процедура ЗагрузитьОблигациюС_MOEX(SECID, ОблигацияОбъект = Неопределено) Экспорт
	Облигация = ОблигацияОбъект;
	Если ОблигацияОбъект = Неопределено Тогда
		Облигация = СоздатьЭлемент();
	КонецЕсли;
		
	БондОбщий.ЗагрузитьТикерС_MOEX(SECID, Облигация);
	
	Если ОблигацияОбъект = Неопределено Тогда
		Облигация.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
