
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимость();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СсылкаMOEXНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(СсылкаMOEX);
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьMOEX(Команда)
	ЗагрузитьMOEXНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗагрузитьMOEXНаСервере()
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	Справочники.Облигации.ЗагрузитьОблигациюС_MOEX(ВРег(СправочникОбъект.SECID), СправочникОбъект);
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	ОбновитьВидимость();
КонецПроцедуры

&НаСервере
Функция ОбновитьВидимость()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.SECID.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
	Иначе
		Элементы.SECID.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.SECID) Тогда
		СсылкаMOEX = БондОбщий.СсылкаНаТикер(Объект.SECID);
	Иначе
		СсылкаMOEX = "";
	КонецЕсли;
КонецФункции

#КонецОбласти
